openfoam/tutorials/lagrangian/reactingParcelFoam/hotBoxes/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    boundaryField
    {
        wallFilm
        {
            type            mapped;
            field       Tsf;
            average         300;
            setAverage      no;
            value           uniform 300;
        }
    }
}

U
{
    boundaryField
    {
        wallFilm
        {
            type            mapped;
            field       Usf;
            average         (0 0 0);
            setAverage      no;
            value           uniform (0 0 0);
        }
    }
}

"nut"
{
    boundaryField
    {
        wallFilm
        {
            value           uniform 0;
        }
    }
}

"alphat"
{
    boundaryField
    {
        wallFilm
        {
            value           uniform 0;
        }
    }
}


// ************************************************************************* //
